#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.refresh_definitions_elastic_credentials will be created
  + resource "kubernetes_secret" "refresh_definitions_elastic_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "refresh-definitions-elastic-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.refresh_definitions_elasticsearch_password will be created
  + resource "random_password" "refresh_definitions_elasticsearch_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 10
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_ecr_lifecycle_policy.clean_up_container_registry will be created
  + resource "aws_ecr_lifecycle_policy" "clean_up_container_registry" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Only keep the last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "foreign-language-reader-content-jobs"
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "foreign-language-reader-content-jobs"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy.pull_access will be created
  + resource "aws_iam_policy" "pull_access" {
      + arn         = (known after apply)
      + description = "IAM policy for pulling containers from foreign-language-reader-content-jobs"
      + id          = (known after apply)
      + name        = "foreign-language-reader-content-jobs-pull-role"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-west-2:037187302622:repository/foreign-language-reader-content-jobs"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy.push_access will be created
  + resource "aws_iam_policy" "push_access" {
      + arn         = (known after apply)
      + description = "IAM policy for pushing containers to foreign-language-reader-content-jobs"
      + id          = (known after apply)
      + name        = "foreign-language-reader-content-jobs-push-role"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-west-2:037187302622:repository/foreign-language-reader-content-jobs"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy_attachment.pull_attach will be created
  + resource "aws_iam_policy_attachment" "pull_attach" {
      + id         = (known after apply)
      + name       = "foreign-language-reader-content-jobs-pull-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-kubernetes",
        ]
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy_attachment.push_attach will be created
  + resource "aws_iam_policy_attachment" "push_attach" {
      + id         = (known after apply)
      + name       = "foreign-language-reader-content-jobs-push-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
